export default {
	$vuetify: {
		close: 'Закрыть',
		dataIterator: {
			pageText: '{0}-{1} из {2}',
			noResultsText: 'Совпадений не найдено',
			loadingText: 'Загрузка объектов...',
		},
		dataTable: {
			itemsPerPageText: 'Строк на страницу:',
			ariaLabel: {
				sortDescending: ': Сортировка по убыванию. Клик для сброса сортировки.',
				sortAscending: ': Сортировка по возрастанию. Клик для сортировки по убыванию.',
				sortNone: ': Не отсортировано. Клик для сортировки по возрастанию.',
			},
			sortBy: 'Сортировать по',
		},
		dataFooter: {
			pageText: '{0}-{1} из {2}',
			itemsPerPageText: 'Строк на страницу:',
			itemsPerPageAll: 'Все',
			nextPage: 'Следующая страница',
			prevPage: 'Предыдущая страница',
			firstPage: 'Перая страница',
			lastPage: 'Последняя страница',
		},
		datePicker: {
			itemsSelected: '{0} выбрано',
		},
			noDataText: 'Нет данных',
			carousel: {
			prev: 'Предыдущее отображение',
			next: 'Следующее отображение',
		},
		calendar: {
			moreEvents: '{0} еще',
		},
		dataLoadingText: 'Идет загрузка данных',		
		texts:{
			//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			main:{
				systems:{
					objects:{	name:'Объекты',	title:'АРМы работы с объектами системы',	},
				},
				links:{
					types:{
						ARM:'АРМ'
					},
					objWork:{name:'Работа с объектами',	title:'Работы с деревом объектов!',	},
					obgView:{name:'Просмотр объектов',	title:'Просмотр созданных в системе объектов!',	},
				},
			},
	//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			modals:{
				auth:		{	title:'Авторизация',},
				treeAdd:	{	title:'Параметры объекта',},
				valSelect:	{	title:'Выбор значения',},
				traceShow:	{	title:'Трассировка',},
			},
			//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			simple:{ 
				actions:{
					add:'Добавить',
					search:'Поиск',
					close:'Закрыть',
					save:'Сохранить',
					cancel:'Отмена',
					accept:'Принять',
					auth:'Авторизоваться',
					authEnd:'Завершить сеанс',
					registration:'Зарегистрироваться',
					chacngePass:'Изменить пароль',
					logOut:'Выйти',
					logIn:'Войти',
				},
				labels:{
					filter:'Фильтр',
					loading:'Загрузка...',
					guest:'Гость',
					auth:'Авторизация',
					detail:'Описание',
					registration:'Регистрация',
					os:{name:'FF - Конструктор форм', year:'2018'},
					searchInFields:'Искать по полям',
					personalAccount:'Личный кабинет',
					numInOrder:'№ п/п',
					dateRangeSeparator:' до ',
				},
				msgs:{
					valMoreOrEq:'Значение должно быть не меньше {0}!',
					valLessOrEq:'Количество символов не должно превышать {0}!',				
					fieldIsNecessary:'Поле обязательное!',				
					fieldMustUsed:'Поле должно быть использовано!',				
					authNeed:'Необходимо авторизоваться!',				
					defTextMes:'Текст сообщения',				
				},
			},
			//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			errors:{
				withOpenDialog: 	{	title:'Ошибка при открытии окна',					text:'Запрашиваемое окно не найдено!',	},
				withAddNestElem: 	{	title:'Ошибка при добавлении элемента',				text:'Для добавления вложенного элемента, необходимо выбрать родительский элемент!',},
				incorrectValue: 	{	title:'Некорректное значение',						text:'Указано некорректное значение!',},
				notFullValue: 		{	title:'Ошибка при указании данных',					text:'Перед сохранением, укажите данные полностью!',},
				saveNoDate: 		{	title:'Ошибка при указании данных',					text:'Перед сохранением, укажите дату!'},
				traceNotFound: 		{	title:'Ошибка отображения трассировки',				text:'Трассировка не найдена!',},
				noLogOut: 			{	title:'Ошибка при завершении сеанса',				text:'Завершить сеанс не удалось!',},
				noSendAddress: 		{	title:'Ошибка отправки данных',						text:'Неуказанн адрес для отправки!',},
				requestRefused:		{	title:'Ошибка отправки данных', 					text:'Отправленные данные были отвергнуты!',},
				requestFaild:		{	title:'Ошибка отправки данных', 					text:'Отправить данные не удалось!',},
				noDialogOpen:		{	title:'Ошибка при открытии окна',					text:'Идентификатор запрашиваемого окна не найден!',},
				noDialogInitId:		{	title:'Ошибка инициализации окна', 					text:'Не указан идентификатор окна',},
				withLogIn:			{	title:'Ошибка авторизации', 						text:'Указаны не корректные данные!',},
				withRegistration:	{	title:'Ошибка регистрации', 						text:'Указаны не корректные данные!',},
				withMailFormat:		{	title:'Ошибка в электронном адресе', 				text:'Некорректный формат адреса!',},
				withPasswordLen:	{	title:'Ошибка в длине пароля', 						text:'Длина пароля минимум 6 символов!',},
				withPasswordConf:	{	title:'Ошибка в подтверждении пароля', 				text:'Введенные пароли должны совпадать!',},
				onlyLetters:		{	title:'Допускаются только буквы', 					text:'Допускаются только буквы!',},
			},
			msgs:{
				loginSucsess: 		{	title:'Авторизация',								text:'Выполнен вход под пользователем {0}!',},
				logoutSucsess: 		{	title:'Авторизация',								text:'Пользователь завершил свой сеанс!',},
				saveDoing: 			{	title:'Сохранение данных', 							text:'Данные успешно сохранены!',},
			},				
			//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		},
	},
}
  